cask_args appdir: "/Applications"

# Taps
tap "homebrew/cask"
tap "gocardless/homebrew-taps"
tap "gocardless/taps"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# General tooling
brew "ack"
brew "autoenv"
brew "automake"
brew "aws-keychain"
brew "readline"
brew "awscli"
brew "base64"
brew "bash"
brew "bash-completion@2"
brew "binutils"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "curl"
brew "go"
brew "dep"
brew "diffutils"
brew "docker"
brew "findutils"
brew "flake8"
brew "fzf"
brew "gawk"
brew "gdb"
brew "git"
brew "git-extras"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "gzip"
brew "htop"
brew "httpie"
brew "hub"
brew "jq"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "libtool"
brew "mercurial"
brew "nvm"
brew "pam_yubico"
brew "postgresql@9.4", link: true
brew "pstree"
brew "task"
brew "taskd"
brew "tasksh"

# Languages
brew "go@1.12"
brew "python"
brew "rbenv"
brew "ruby-build"

# GoCardless
brew "anu"
brew "draupnir"

# Kubernetes
brew "kubernetes-cli"

# Google
cask "google-cloud-sdk"

# AWS
brew "awscli"
brew "aws-keychain"

# Infrastructure
brew "terraform"
